Revit 2024 API
BuiltInFailures.EditingFailures Class
 Failures related to editing operations.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class EditingFailures
Visual Basic
Public NotInheritable Class EditingFailures
Visual C++
public ref class EditingFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.EditingFailures
See Also
BuiltInFailures.EditingFailures Members
Autodesk.Revit.DB Namespace